In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from numpy.random import seed
from numpy.random import rand
from numpy.random import random_integers


%matplotlib inline

In [2]:
apple=pd.read_csv('../data/financial/apple.csv', index_col=0, parse_dates=True)
print apple.head(2)
print apple.tail(2)

            Open  High   Low  Close    Volume
Date
1980-12-12     0  4.12  4.11   4.11  14657300
1980-12-15     0  3.91  3.89   3.89   5496400
              Open   High     Low  Close    Volume
Date
2015-02-20  128.62  129.5  128.05  129.5  48948419
2015-02-23  130.02  133.0  129.66  133.0  67871830

In [3]:
print apple.shape

(8640, 5)

In [4]:
print apple.columns

Index([u'Open', u'High', u'Low', u'Close', u'Volume'], dtype='object')

In [5]:
apple["2002-11-14":"2002-12-18"]

            Open  High   Low  Close     Volume
Date
2002-11-14  1.14  1.17  1.13   1.16   34256600
2002-11-15  1.16  1.16  1.13   1.14   39848200
2002-11-18  1.16  1.16  1.09   1.12   38490200
2002-11-19  1.11  1.12  1.07   1.09   50922200
2002-11-20  1.09  1.12  1.09   1.11   50206800
2002-11-21  1.14  1.17  1.12   1.17  102193000
2002-11-22  1.15  1.16  1.14   1.14   54815600
2002-11-25  1.14  1.15  1.12   1.14   48836200
2002-11-26  1.13  1.14  1.09   1.10   57488200
2002-11-27  1.11  1.13  1.10   1.12   70130200
2002-11-29  1.13  1.13  1.10   1.11   34637400
2002-12-02  1.14  1.15  1.07   1.08   97340600
2002-12-03  1.09  1.10  1.08   1.08   54828200
2002-12-04  1.08  1.08  1.04   1.07   73498600
2002-12-05  1.07  1.08  1.04   1.04   58583000
2002-12-06  1.05  1.08  1.04   1.07   60109000
2002-12-09  1.07  1.07  1.05   1.05   56326200
2002-12-10  1.05  1.10  1.05   1.09   74708200
2002-12-11  1.09  1.11  1.08   1.11   60757200
2002-12-12  1.11  1.11  1.07   1.08   35819000
2002-12-13  1.08  1.08  1.05   1.06   39739000
2002-12-16  1.06  1.08  1.04   1.06   61180000
2002-12-17  1.06  1.08  1.05   1.08   54243000
2002-12-18  1.06  1.06  1.04   1.04   35868000

In [6]:
print apple.iloc[8000]
print
print apple.iloc[8000,0]
print apple.iloc[8000,1]
print apple.iloc[8000,2]
print apple.iloc[8000,3]
print apple.iloc[8000,4]

Open            88.97
High            89.29
Low             88.29
Close           88.70
Volume    72627492.00
Name: 2012-08-07 00:00:00, dtype: float64

88.97
89.29
88.29
88.7
72627492.0

In [7]:
print "min is:",apple['Close'].min()
print "max is:",apple['Close'].max()
print "standard deviation is:",apple['Close'].std()

min is: 0.94
max is: 133.0
standard deviation is: 24.1926958235

In [8]:
over_100=apple[apple['Close']>100]

In [9]:
print over_100.shape

(115, 5)

In [10]:
apple['Close'][apple['Close']>100].count()

115

seed(42)

df = pd.DataFrame({'Weather' : ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * rand(7), 'Number' : random_integers(1, 9, size=(7,))})

print df

In [11]:
df_mlb=pd.read_csv('../data/mlb/MLB_2014_2015.csv',  parse_dates=True, index_col=0)
print df_mlb.shape
print df_mlb.head()

(60, 13)
     Year  lg    R   2B  3B   HR  RBI  SB   BB     BA    OBP    SLG    OPS
Tm
BAL  2015  AL  713  246  20  217  686  44  418  0.250  0.307  0.421  0.728
BOS  2015  AL  748  294  33  161  706  71  478  0.265  0.325  0.415  0.740
CHW  2015  AL  622  260  27  136  595  68  404  0.250  0.306  0.380  0.686
CLE  2015  AL  669  303  29  141  640  86  533  0.256  0.325  0.401  0.725
DET  2015  AL  689  289  49  151  660  83  455  0.270  0.328  0.420  0.748

In [12]:
print "max HR: ",df_mlb.HR.max(),"hit by",df_mlb.HR.idxmax()

max HR:  232 hit by TOR

In [13]:
year_group=df_mlb.groupby('Year')

print len(year_group)

for name, group in year_group:
    print "Group is: ", name
    print group
    print

2
Group is:  2014
     Year  lg    R   2B  3B   HR  RBI   SB   BB     BA    OBP    SLG    OPS
Tm
BAL  2014  AL  705  264  16  211  681   44  401  0.256  0.311  0.422  0.734
BOS  2014  AL  634  282  20  123  601   63  535  0.244  0.316  0.369  0.684
CHW  2014  AL  660  279  32  155  625   85  417  0.253  0.310  0.398  0.708
CLE  2014  AL  669  284  23  142  644  104  504  0.253  0.317  0.389  0.706
DET  2014  AL  757  325  26  155  731  106  443  0.277  0.331  0.426  0.757
HOU  2014  AL  629  240  19  163  596  122  495  0.242  0.309  0.383  0.692
KCR  2014  AL  651  286  29   95  604  153  380  0.263  0.314  0.376  0.690
LAA  2014  AL  773  304  31  155  729   81  492  0.259  0.322  0.406  0.728
MIN  2014  AL  715  316  27  128  675   99  544  0.254  0.324  0.389  0.713
NYY  2014  AL  633  247  26  147  591  112  452  0.245  0.307  0.380  0.687
OAK  2014  AL  729  253  33  146  686   83  586  0.244  0.320  0.381  0.700
SEA  2014  AL  634  247  32  136  600   96  396  0.244  0.300  0.376  0.676
TBR  2014  AL  612  263  24  117  586   63  527  0.247  0.317  0.367  0.684
TEX  2014  AL  637  260  28  111  597  105  417  0.256  0.314  0.375  0.689
TOR  2014  AL  723  282  24  177  690   78  502  0.259  0.323  0.414  0.736
ARI  2014  NL  615  259  47  118  573   86  398  0.248  0.302  0.376  0.678
ATL  2014  NL  573  240  22  123  545   95  472  0.241  0.305  0.360  0.665
CHC  2014  NL  614  270  31  157  590   65  442  0.239  0.300  0.385  0.684
CIN  2014  NL  595  254  20  131  562  122  415  0.238  0.296  0.365  0.661
COL  2014  NL  755  307  41  186  721   85  397  0.276  0.327  0.445  0.772
LAD  2014  NL  718  302  38  134  686  138  519  0.265  0.333  0.406  0.738
MIA  2014  NL  645  254  36  122  614   58  501  0.253  0.317  0.378  0.694
MIL  2014  NL  650  297  28  150  617  102  423  0.250  0.311  0.397  0.708
NYM  2014  NL  629  275  19  125  602  101  516  0.239  0.308  0.364  0.673
PHI  2014  NL  619  251  27  125  584  109  443  0.242  0.302  0.363  0.665
PIT  2014  NL  682  275  30  156  659  104  520  0.259  0.330  0.404  0.734
SDP  2014  NL  535  224  30  109  500   91  468  0.226  0.292  0.342  0.634
SFG  2014  NL  665  257  42  132  636   56  427  0.255  0.311  0.388  0.699
STL  2014  NL  619  275  21  105  585   57  471  0.253  0.320  0.369  0.689
WSN  2014  NL  686  265  27  152  635  101  517  0.253  0.321  0.393  0.714

Group is:  2015
     Year  lg    R   2B  3B   HR  RBI   SB   BB     BA    OBP    SLG    OPS
Tm
BAL  2015  AL  713  246  20  217  686   44  418  0.250  0.307  0.421  0.728
BOS  2015  AL  748  294  33  161  706   71  478  0.265  0.325  0.415  0.740
CHW  2015  AL  622  260  27  136  595   68  404  0.250  0.306  0.380  0.686
CLE  2015  AL  669  303  29  141  640   86  533  0.256  0.325  0.401  0.725
DET  2015  AL  689  289  49  151  660   83  455  0.270  0.328  0.420  0.748
HOU  2015  AL  729  278  26  230  691  121  486  0.250  0.315  0.437  0.752
KCR  2015  AL  724  300  42  139  689  104  383  0.269  0.322  0.412  0.734
LAA  2015  AL  661  243  21  176  621   52  435  0.246  0.307  0.396  0.702
MIN  2015  AL  696  277  44  156  661   70  439  0.247  0.305  0.399  0.704
NYY  2015  AL  764  272  19  212  737   63  554  0.251  0.323  0.421  0.744
OAK  2015  AL  694  277  46  146  661   78  475  0.251  0.312  0.395  0.707
SEA  2015  AL  656  262  22  198  624   69  478  0.249  0.311  0.411  0.722
TBR  2015  AL  644  278  32  167  612   87  436  0.252  0.314  0.406  0.720
TEX  2015  AL  751  279  32  172  707  101  503  0.257  0.325  0.413  0.739
TOR  2015  AL  891  308  17  232  852   88  570  0.269  0.340  0.457  0.797
ARI  2015  NL  720  289  48  154  680  132  490  0.264  0.324  0.414  0.738
ATL  2015  NL  573  251  18  100  548   69  471  0.251  0.314  0.359  0.674
CHC  2015  NL  689  272  30  171  657   95  567  0.244  0.321  0.398  0.719
CIN  2015  NL  640  257  27  167  613  134  496  0.248  0.312  0.394  0.706
COL  2015  NL  737  274  49  186  702   97  388  0.265  0.315  0.432  0.748
LAD  2015  NL  667  263  26  187  638   59  563  0.250  0.326  0.413  0.739
MIA  2015  NL  613  236  40  120  575  112  375  0.260  0.310  0.384  0.694
MIL  2015  NL  655  274  34  145  624   84  412  0.251  0.307  0.393  0.700
NYM  2015  NL  683  295  17  177  654   51  488  0.244  0.312  0.400  0.712
PHI  2015  NL  626  272  37  130  586   88  387  0.249  0.303  0.382  0.684
PIT  2015  NL  697  292  27  140  661   98  461  0.260  0.323  0.396  0.719
SDP  2015  NL  650  260  36  148  623   82  426  0.243  0.300  0.385  0.685
SFG  2015  NL  696  288  39  136  663   93  457  0.267  0.326  0.406  0.732
STL  2015  NL  647  288  39  137  619   69  506  0.253  0.321  0.394  0.716
WSN  2015  NL  703  265  13  177  665   57  539  0.251  0.321  0.403  0.724

In [14]:
print year_group.first()
print "Mean: "
print year_group.mean()

      lg    R   2B  3B   HR  RBI  SB   BB     BA    OBP    SLG    OPS
Year
2014  AL  705  264  16  211  681  44  401  0.256  0.311  0.422  0.734
2015  AL  713  246  20  217  686  44  418  0.250  0.307  0.421  0.728
Mean:
               R          2B    3B          HR         RBI         SB  \
Year
2014  658.700000  271.233333  28.3  139.533333  624.833333  92.133333
2015  688.233333  274.733333  31.3  163.633333  655.000000  83.500000

              BB      BA       OBP       SLG       OPS
Year
2014  467.333333  0.2511  0.313667  0.386200  0.699733
2015  469.100000  0.2544  0.316667  0.404567  0.721267

In [15]:
lg_year_group=df_mlb.groupby(['lg','Year'])
print "the groups are: ", lg_year_group.groups

the groups are:  {('AL', 2014): ['BAL', 'BOS', 'CHW', 'CLE', 'DET', 'HOU', 'KCR', 'LAA', 'MIN', 'NYY', 'OAK', 'SEA', 'TBR', 'TEX', 'TOR'], ('NL', 2015): ['ARI', 'ATL', 'CHC', 'CIN', 'COL', 'LAD', 'MIA', 'MIL', 'NYM', 'PHI', 'PIT', 'SDP', 'SFG', 'STL', 'WSN'], ('AL', 2015): ['BAL', 'BOS', 'CHW', 'CLE', 'DET', 'HOU', 'KCR', 'LAA', 'MIN', 'NYY', 'OAK', 'SEA', 'TBR', 'TEX', 'TOR'], ('NL', 2014): ['ARI', 'ATL', 'CHC', 'CIN', 'COL', 'LAD', 'MIA', 'MIL', 'NYM', 'PHI', 'PIT', 'SDP', 'SFG', 'STL', 'WSN']}

In [16]:
print "WF Aggregated\n", lg_year_group.agg([np.mean, np.max])

WF Aggregated
                  R               2B         3B               HR       \
               mean amax        mean amax  mean amax        mean amax
lg Year
AL 2014  677.400000  773  275.466667  325  26.0   33  144.066667  211
   2015  710.066667  891  277.733333  308  30.6   49  175.600000  232
NL 2014  640.000000  755  267.000000  307  30.6   47  135.000000  186
   2015  666.400000  737  271.733333  295  32.0   49  151.666667  187

                RBI       ...            BB             BA              OBP  \
               mean amax  ...          mean amax      mean   amax      mean
lg Year                   ...
AL 2014  642.400000  731  ...    472.733333  586  0.253067  0.277  0.315667
   2015  676.133333  852  ...    469.800000  570  0.255467  0.270  0.317667
NL 2014  607.266667  721  ...    461.933333  520  0.249133  0.276  0.311667
   2015  633.866667  702  ...    468.400000  567  0.253333  0.267  0.315667

                     SLG              OPS
          amax      mean   amax      mean   amax
lg Year
AL 2014  0.331  0.390067  0.426  0.705600  0.757
   2015  0.340  0.412267  0.457  0.729867  0.797
NL 2014  0.333  0.382333  0.445  0.693867  0.772
   2015  0.326  0.396867  0.432  0.712667  0.748

[4 rows x 22 columns]

In [17]:
df_2015=df_mlb[df_mlb.Year==2015]
df_2014=df_mlb[df_mlb.Year==2014]

print df_2015.shape
print df_2014.shape

(30, 13)
(30, 13)

In [18]:
df_concat=pd.concat([df_2014,df_2015])
print df_concat.shape

(60, 13)

In [19]:
df_append = df_2014.append(df_2015)
print df_append.shape

(60, 13)

In [20]:
from IPython.display import display

df_null=pd.read_csv('../data/mlb/MLB_null.csv',  parse_dates=True, index_col=0)
display(df_null)
print
display(df_null.fillna(30000))

     Year  lg    R   2B
Tm
BAL  2015  AL  713  246
BOS  2015  AL  748  294
CHW  2015  AL  NaN  260
CLE  2015  AL  669  303
DET  2015  AL  689  289

     Year  lg      R   2B
Tm
BAL  2015  AL    713  246
BOS  2015  AL    748  294
CHW  2015  AL  30000  260
CLE  2015  AL    669  303
DET  2015  AL    689  289

In [21]:
df_mlb.shape

(60, 13)

In [25]:
df_mlb_pivot=pd.pivot_table(df_mlb, columns='Year', aggfunc=np.mean)
print df_mlb_pivot.shape
print
display(df_mlb_pivot)

(11, 2)

Year        2014        2015
2B    271.233333  274.733333
3B     28.300000   31.300000
BA      0.251100    0.254400
BB    467.333333  469.100000
HR    139.533333  163.633333
OBP     0.313667    0.316667
OPS     0.699733    0.721267
R     658.700000  688.233333
RBI   624.833333  655.000000
SB     92.133333   83.500000
SLG     0.386200    0.404567

In [30]:
from pandas.io.data import Options
import datetime

today=datetime.date.today()